
  #### plan-nodes-20251129T182506.txt 📖: `success`
  <details><summary>Show Contents</summary>

  ```

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.tiles-test.module.talos-vm["tiles-test-cp"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7411"
        name                                 = "tiles-test-cp"
      ~ network_interface_names              = [
            # (27 unchanged elements hidden)
            "lxc05c46934a16b",
          ~ "lxc490b1287569a" -> "lxccce74b9c86f3",
        ]
        tags                                 = []
        # (32 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.k8s-test.google_iam_oauth_client.argocd will be created
  + resource "google_iam_oauth_client" "argocd" {
      + allowed_grant_types   = [
          + "authorization_code",
        ]
      + allowed_redirect_uris = [
          + "https://argocd.tiles-test.symmatree.com/api/dex/callback",
        ]
      + allowed_scopes        = [
          + "openid",
          + "email",
        ]
      + client_id             = (known after apply)
      + display_name          = "tiles-test-argocd-oauth"
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + location              = "global"
      + name                  = (known after apply)
      + oauth_client_id       = "tiles-test-argocd-oauth"
      + project               = "symm-custodes"
      + state                 = (known after apply)
    }

  # module.k8s-test.google_iam_oauth_client_credential.argocd will be created
  + resource "google_iam_oauth_client_credential" "argocd" {
      + client_secret              = (sensitive value)
      + id                         = (known after apply)
      + location                   = "global"
      + name                       = (known after apply)
      + oauth_client_credential_id = "tiles-test-argocd-oauth-credential"
      + oauthclient                = (known after apply)
      + project                    = "symm-custodes"
    }

  # module.k8s-test.onepassword_item.argocd_google_oauth will be created
  + resource "onepassword_item" "argocd_google_oauth" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "argocd-google-oauth"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "credentials"

          + field {
              + id    = (known after apply)
              + label = "OAUTH_CLIENT_ID"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "OAUTH_CLIENT_SECRET"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "cluster_name"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "argocd_url"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

  ```

  </details>
  
  